{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "[SEP]": 4,
      "[PAD]": 5,
      "[MASK]": 6,
      "a": 7,
      "c": 8,
      "g": 9,
      "n": 10,
      "t": 11,
      "ag": 12,
      "tg": 13,
      "cc": 14,
      "tt": 15,
      "aa": 16,
      "tc": 17,
      "ac": 18,
      "agg": 19,
      "tgg": 20,
      "at": 21,
      "aag": 22,
      "tcc": 23,
      "acc": 24,
      "tgc": 25,
      "gg": 26,
      "att": 27,
      "agc": 28,
      "atg": 29,
      "aac": 30,
      "ttc": 31,
      "atc": 32,
      "ttg": 33,
      "ccc": 34,
      "agag": 35,
      "taa": 36,
      "gc": 37,
      "aagg": 38,
      "tac": 39,
      "tgtg": 40,
      "aaaa": 41,
      "tag": 42,
      "acac": 43,
      "atgg": 44,
      "tttt": 45,
      "tctc": 46,
      "aggc": 47,
      "tggg": 48,
      "tat": 49,
      "acag": 50,
      "aggg": 51,
      "tggc": 52,
      "tccc": 53,
      "ttcc": 54,
      "agcc": 55,
      "atcc": 56,
      "tgcc": 57,
      "agaa": 58,
      "accc": 59,
      "aagc": 60,
      "attc": 61,
      "atgc": 62,
      "tctg": 63,
      "ttgg": 64,
      "tttc": 65,
      "actg": 66,
      "acaa": 67,
      "tttg": 68,
      "ataa": 69,
      "tatt": 70,
      "tatg": 71,
      "actc": 72,
      "agtg": 73,
      "tgggg": 74,
      "ttgc": 75,
      "tagg": 76,
      "tacc": 77,
      "agac": 78,
      "aacc": 79,
      "agagg": 80,
      "tgtc": 81,
      "agtc": 82,
      "taag": 83,
      "ggc": 84,
      "tatc": 85,
      "gcc": 86,
      "tagc": 87,
      "ttaa": 88,
      "taac": 89,
      "tgaa": 90,
      "atat": 91,
      "tgag": 92,
      "ggg": 93,
      "acg": 94,
      "aaag": 95,
      "tcag": 96,
      "atac": 97,
      "tcac": 98,
      "attg": 99,
      "tctt": 100,
      "aaac": 101,
      "atag": 102,
      "cccc": 103,
      "tgtt": 104,
      "agaag": 105,
      "tgac": 106,
      "tcccc": 107,
      "tcaa": 108,
      "tggcc": 109,
      "agtt": 110,
      "aaggc": 111,
      "actt": 112,
      "aggcc": 113,
      "tgggc": 114,
      "agggg": 115,
      "atggc": 116,
      "aaggg": 117,
      "agggc": 118,
      "aatt": 119,
      "aatg": 120,
      "tgtgg": 121,
      "tctcc": 122,
      "aagcc": 123,
      "ttccc": 124,
      "tcg": 125,
      "aagggc": 126,
      "acccc": 127,
      "ttttc": 128,
      "atccc": 129,
      "tgtgtgtg": 130,
      "aagaa": 131,
      "atggg": 132,
      "ttttg": 133,
      "ttggg": 134,
      "atgcc": 135,
      "ta": 136,
      "tttcc": 137,
      "acacacac": 138,
      "tcttc": 139,
      "acagg": 140,
      "acagc": 141,
      "aaaac": 142,
      "tagag": 143,
      "attcc": 144,
      "atttt": 145,
      "agagc": 146,
      "aatc": 147,
      "agaac": 148,
      "acat": 149,
      "tgtcc": 150,
      "tttaa": 151,
      "agccc": 152,
      "tgagg": 153,
      "gggg": 154,
      "aaagg": 155,
      "ttggc": 156,
      "tgtgc": 157,
      "tctgc": 158,
      "ttgcc": 159,
      "ttac": 160,
      "tcagc": 161,
      "agagagag": 162,
      "agatg": 163,
      "aaat": 164,
      "agttc": 165,
      "taggc": 166,
      "acacc": 167,
      "agat": 168,
      "tctgg": 169,
      "tagcc": 170,
      "tgagc": 171,
      "tgccc": 172,
      "tatgg": 173,
      "taagg": 174,
      "tcagg": 175,
      "acatc": 176,
      "aaaag": 177,
      "agacc": 178,
      "aaaaaaaa": 179,
      "taaaa": 180,
      "tattc": 181,
      "tgttc": 182,
      "acatg": 183,
      "tttgg": 184,
      "atatt": 185,
      "aaagc": 186,
      "aacag": 187,
      "tatcc": 188,
      "tctctctc": 189,
      "actgc": 190,
      "tcctcc": 191,
      "tcacc": 192,
      "tttttttt": 193,
      "taccc": 194,
      "aaatg": 195,
      "actcc": 196,
      "agtgc": 197,
      "agtgg": 198,
      "taggg": 199,
      "aaacc": 200,
      "atatg": 201,
      "aggagg": 202,
      "acttc": 203,
      "gggc": 204,
      "tttgc": 205,
      "tgacc": 206,
      "tgaag": 207,
      "agtcc": 208,
      "tgttg": 209,
      "atttc": 210,
      "tgaac": 211,
      "tatgc": 212,
      "taagc": 213,
      "agatc": 214,
      "aatcc": 215,
      "atatc": 216,
      "acaag": 217,
      "tgatg": 218,
      "acaac": 219,
      "ttctc": 220,
      "actgg": 221,
      "atagc": 222,
      "tgtaa": 223,
      "aaccc": 224,
      "acatt": 225,
      "tcatc": 226,
      "tctac": 227,
      "attgc": 228,
      "aataa": 229,
      "ggcc": 230,
      "aaatc": 231,
      "atccagag": 232,
      "acagag": 233,
      "tcttg": 234,
      "ttatt": 235,
      "atacc": 236,
      "tttac": 237,
      "ttag": 238,
      "atagg": 239,
      "tggggg": 240,
      "aaatt": 241,
      "tgtac": 242,
      "tcctc": 243,
      "aattc": 244,
      "acagcc": 245,
      "aactc": 246,
      "acttg": 247,
      "agcccc": 248,
      "attgg": 249,
      "agatt": 250,
      "taacc": 251,
      "acgc": 252,
      "ataac": 253,
      "agaggc": 254,
      "tggtgg": 255,
      "tttctc": 256,
      "ataag": 257,
      "aggaa": 258,
      "tcatg": 259,
      "tgatc": 260,
      "agttg": 261,
      "acgg": 262,
      "ttaag": 263,
      "tgtctc": 264,
      "agcg": 265,
      "tgtag": 266,
      "tctgcc": 267,
      "aggggc": 268,
      "aaggcc": 269,
      "aga": 270,
      "aggaag": 271,
      "agtac": 272,
      "accg": 273,
      "tggggc": 274,
      "aatgg": 275,
      "acaggg": 276,
      "tcatt": 277,
      "aatgc": 278,
      "tcaag": 279,
      "nn": 280,
      "ttttcc": 281,
      "agaaaa": 282,
      "tcttcc": 283,
      "ttatg": 284,
      "ataaaa": 285,
      "actac": 286,
      "tttag": 287,
      "tcaac": 288,
      "tgatt": 289,
      "aca": 290,
      "tgcg": 291,
      "agtaa": 292,
      "ttagc": 293,
      "ttt": 294,
      "agaagg": 295,
      "ttatc": 296,
      "ttacc": 297,
      "aagaag": 298,
      "ttcttc": 299,
      "tccacc": 300,
      "aacaa": 301,
      "tgt": 302,
      "tttat": 303,
      "tccg": 304,
      "aacg": 305,
      "tggaa": 306,
      "agcac": 307,
      "gcg": 308,
      "agctc": 309,
      "agagcc": 310,
      "aaaacc": 311,
      "tgtat": 312,
      "tctgtg": 313,
      "aatac": 314,
      "ttagg": 315,
      "tgggcc": 316,
      "ttaac": 317,
      "aattg": 318,
      "tgctc": 319,
      "tggacag": 320,
      "agtag": 321,
      "tgagcc": 322,
      "agaggg": 323,
      "actaa": 324,
      "agacag": 325,
      "accacc": 326,
      "tctaa": 327,
      "ttctcc": 328,
      "agacac": 329,
      "atcccc": 330,
      "agcagc": 331,
      "ttcccc": 332,
      "gccc": 333,
      "ttctg": 334,
      "aggatg": 335,
      "tct": 336,
      "tttctg": 337,
      "acaggc": 338,
      "agggcc": 339,
      "atggcc": 340,
      "aaaggc": 341,
      "acaaaa": 342,
      "ttgggg": 343,
      "agctg": 344,
      "tgtgcc": 345,
      "tttatt": 346,
      "tgcccc": 347,
      "tggaac": 348,
      "tctag": 349,
      "agagagg": 350,
      "ttcg": 351,
      "acatcc": 352,
      "tctccc": 353,
      "tcgg": 354,
      "tttccc": 355,
      "atcg": 356,
      "agaacc": 357,
      "aaa": 358,
      "atgggg": 359,
      "atacac": 360,
      "atgggc": 361,
      "tgtgtgtgtgtgtgtg": 362,
      "acgcc": 363,
      "agttcc": 364,
      "aagagc": 365,
      "aatag": 366,
      "acaacc": 367,
      "agaagc": 368,
      "tgctg": 369,
      "gagg": 370,
      "actgtg": 371,
      "acacacacacacacac": 372,
      "tggagg": 373,
      "gtg": 374,
      "agctcc": 375,
      "aagggg": 376,
      "aaagaa": 377,
      "atctc": 378,
      "atgtg": 379,
      "ata": 380,
      "aagtgc": 381,
      "gtgc": 382,
      "attttc": 383,
      "agt": 384,
      "ttaaaa": 385,
      "tcctg": 386,
      "tggtg": 387,
      "actag": 388,
      "aatat": 389,
      "act": 390,
      "atctg": 391,
      "tccccc": 392,
      "ttat": 393,
      "tgctgc": 394,
      "attatt": 395,
      "aagagg": 396,
      "tcagcc": 397,
      "tcgc": 398,
      "acttcc": 399,
      "tctacc": 400,
      "aaaccc": 401,
      "ttggcc": 402,
      "acatgg": 403,
      "atccagagagagg": 404,
      "acatgc": 405,
      "tagccc": 406,
      "tgtttt": 407,
      "agctgc": 408,
      "accatg": 409,
      "tcat": 410,
      "tggccc": 411,
      "ttgttg": 412,
      "aacaac": 413,
      "aaacac": 414,
      "acagaagggc": 415,
      "acaccc": 416,
      "tgaggc": 417,
      "aagaac": 418,
      "ttctt": 419,
      "acctc": 420,
      "agatgg": 421,
      "agagaac": 422,
      "agaccc": 423,
      "atgtcc": 424,
      "agagagagagagagag": 425,
      "atatatat": 426,
      "aacccc": 427,
      "ttctgc": 428,
      "tggagc": 429,
      "accccc": 430,
      "tttgtg": 431,
      "aaagcc": 432,
      "tacg": 433,
      "tgat": 434,
      "tggaag": 435,
      "aggagc": 436,
      "aaacaa": 437,
      "attttg": 438,
      "ttgggc": 439,
      "atttaa": 440,
      "atgccc": 441,
      "tctctctctctctctc": 442,
      "tga": 443,
      "tgtctg": 444,
      "atttcc": 445,
      "aggccc": 446,
      "agtggg": 447,
      "atctcc": 448,
      "attccc": 449,
      "agtctc": 450,
      "aaaagc": 451,
      "acctcc": 452,
      "aagccc": 453,
      "gtc": 454,
      "ttttgg": 455,
      "atgtgc": 456,
      "aggaac": 457,
      "tgtggc": 458,
      "atgaa": 459,
      "atgtc": 460,
      "gtgg": 461,
      "acattc": 462,
      "tgcttc": 463,
      "aaagag": 464,
      "actctg": 465,
      "agtat": 466,
      "tagacc": 467,
      "tgtatg": 468,
      "agcacc": 469,
      "agcatc": 470,
      "aggtgg": 471,
      "taataa": 472,
      "actgcc": 473,
      "actccc": 474,
      "aagtc": 475,
      "ttgtc": 476,
      "nnnn": 477,
      "agtgtg": 478,
      "taagcc": 479,
      "actat": 480,
      "aggtc": 481,
      "acaagg": 482,
      "tgtccc": 483,
      "tccttc": 484,
      "aaataa": 485,
      "tgtggg": 486,
      "actggg": 487,
      "aagatg": 488,
      "atataa": 489,
      "atagag": 490,
      "tagaa": 491,
      "tggtc": 492,
      "agtccc": 493,
      "tgagag": 494,
      "aagacc": 495,
      "aggacc": 496,
      "tccagc": 497,
      "tcctgc": 498,
      "gagc": 499,
      "ttttgc": 500,
      "actctc": 501,
      "agtggc": 502,
      "agactg": 503,
      "gcccc": 504,
      "gcgc": 505,
      "actggc": 506,
      "tggtgc": 507,
      "aggggg": 508,
      "ttcaa": 509,
      "tatgcc": 510,
      "agatcc": 511,
      "ttcttg": 512,
      "actgagcc": 513,
      "agacaa": 514,
      "gtcc": 515,
      "tctttt": 516,
      "atctgc": 517,
      "gaa": 518,
      "tattcc": 519,
      "tctttc": 520,
      "tca": 521,
      "cccagc": 522,
      "aggtg": 523,
      "atagaa": 524,
      "aactgc": 525,
      "tgggatt": 526,
      "acctgc": 527,
      "tagggc": 528,
      "atcttc": 529,
      "tcacac": 530,
      "aagtcc": 531,
      "agtttg": 532,
      "tttgcc": 533,
      "agatgc": 534,
      "agtttt": 535,
      "tcactg": 536,
      "aacagaagggc": 537,
      "tta": 538,
      "aat": 539,
      "actttt": 540,
      "agtttc": 541,
      "tttggg": 542,
      "tgtttg": 543,
      "tcagag": 544,
      "taaaac": 545,
      "atgtgg": 546,
      "agtctg": 547,
      "agactc": 548,
      "atatcc": 549,
      "acataa": 550,
      "tccagg": 551,
      "agtgcc": 552,
      "agcctgg": 553,
      "atacag": 554,
      "taggcc": 555,
      "tggagag": 556,
      "aaatgc": 557,
      "aaaagg": 558,
      "atattc": 559,
      "agcagg": 560,
      "tcagtgg": 561,
      "agagagagg": 562,
      "acaagc": 563,
      "atcttg": 564,
      "tgagaa": 565,
      "agattc": 566,
      "tctggg": 567,
      "cccg": 568,
      "atttac": 569,
      "atcatc": 570,
      "aagttc": 571,
      "ggggc": 572,
      "agcttc": 573,
      "atgtac": 574,
      "tagaac": 575,
      "tgaggg": 576,
      "agaagggc": 577,
      "agctgg": 578,
      "aaacag": 579,
      "tagggg": 580,
      "tttctttc": 581,
      "attgtg": 582,
      "atagcc": 583,
      "atgatg": 584,
      "tcatcc": 585,
      "ttgaac": 586,
      "tctggc": 587,
      "tccatc": 588,
      "gttc": 589,
      "tcctgg": 590,
      "aggtgc": 591,
      "tttaag": 592,
      "aaaggg": 593,
      "aatttt": 594,
      "atttg": 595,
      "acatac": 596,
      "cg": 597,
      "actttc": 598,
      "atctgg": 599,
      "tacccc": 600,
      "ttgtg": 601,
      "aaattc": 602,
      "tgcatg": 603,
      "aagtg": 604,
      "tttatg": 605,
      "tttggc": 606,
      "aagaaaa": 607,
      "aaagac": 608,
      "aaactc": 609,
      "gaac": 610,
      "acttgg": 611,
      "atatgc": 612,
      "actttg": 613,
      "atgttc": 614,
      "tcaggc": 615,
      "tctat": 616,
      "tgctgg": 617,
      "atatgg": 618,
      "aaatcc": 619,
      "gaag": 620,
      "accttg": 621,
      "taaggg": 622,
      "atacaa": 623,
      "tcaggg": 624,
      "tccttg": 625,
      "ttacag": 626,
      "ttctgg": 627,
      "tttttaa": 628,
      "tttatc": 629,
      "tgcagc": 630,
      "ataacc": 631,
      "acctg": 632,
      "atagtg": 633,
      "acttgc": 634,
      "agctac": 635,
      "tgctcc": 636,
      "aagatc": 637,
      "aactg": 638,
      "aatccc": 639,
      "aaaataa": 640,
      "ttagaa": 641,
      "attggc": 642,
      "ttgccc": 643,
      "atttatt": 644,
      "aattcc": 645,
      "atttgc": 646,
      "agaaagaa": 647,
      "atgtgtg": 648,
      "aacagc": 649,
      "aatggc": 650,
      "accatc": 651,
      "accagc": 652,
      "atgtaa": 653,
      "aactcc": 654,
      "acctgg": 655,
      "tgagac": 656,
      "actatg": 657,
      "tgtttc": 658,
      "aggctggcc": 659,
      "atttttt": 660,
      "tcagtg": 661,
      "tgaagc": 662,
      "ataccc": 663,
      "tgttcc": 664,
      "aaagtc": 665,
      "tcaccc": 666,
      "tggtac": 667,
      "tctttg": 668,
      "aacaaaa": 669,
      "tagagg": 670,
      "ttgttc": 671,
      "aacatc": 672,
      "accttc": 673,
      "aaatgg": 674,
      "agataa": 675,
      "tcacag": 676,
      "tgacac": 677,
      "tgaagg": 678,
      "atttctg": 679,
      "taaggc": 680,
      "ttccagg": 681,
      "tgagtg": 682,
      "tcagaa": 683,
      "aaactg": 684,
      "agagaag": 685,
      "atgagg": 686,
      "atcaag": 687,
      "ttgtgg": 688,
      "tttacc": 689,
      "tgaaaa": 690,
      "tagaag": 691,
      "ttacac": 692,
      "tatccc": 693,
      "ttagcc": 694,
      "tccctgtgg": 695,
      "tcaaaa": 696,
      "gatg": 697,
      "aggtcc": 698,
      "agcaag": 699,
      "tttgtttg": 700,
      "tatatg": 701,
      "aatgaa": 702,
      "tgacag": 703,
      "tcatgg": 704,
      "tgaccc": 705,
      "agaggcc": 706,
      "tggtcc": 707,
      "aatatt": 708,
      "attgaa": 709,
      "aggac": 710,
      "ataaataa": 711,
      "gacc": 712,
      "attgtc": 713,
      "agttgg": 714,
      "tggatg": 715,
      "aaaaaaaaaaaaaaaa": 716,
      "ttgtcc": 717,
      "tggttc": 718,
      "aggatc": 719,
      "agaagacag": 720,
      "taaccc": 721,
      "aggttc": 722,
      "ataggc": 723,
      "aattaa": 724,
      "tgatgg": 725,
      "ttagag": 726,
      "tgtatt": 727,
      "aagtac": 728,
      "aacacc": 729,
      "tcagtc": 730,
      "tttttttttttttttt": 731,
      "atttat": 732,
      "ttataa": 733,
      "ttattc": 734,
      "tcttgc": 735,
      "aaagtg": 736,
      "ggggg": 737,
      "agggaggg": 738,
      "tttaac": 739,
      "agtaag": 740,
      "acacg": 741,
      "acggc": 742,
      "tgactc": 743,
      "taaatg": 744,
      "aatctc": 745,
      "ttctac": 746,
      "tcctgcc": 747,
      "tgactg": 748,
      "tttagg": 749,
      "attgcc": 750,
      "atagatag": 751,
      "aggagag": 752,
      "aggaggc": 753,
      "tagagc": 754,
      "tgggaagg": 755,
      "tgcttg": 756,
      "aagttg": 757,
      "tgagttc": 758,
      "tcccagc": 759,
      "atactg": 760,
      "tcactc": 761,
      "tgctggg": 762,
      "ataagg": 763,
      "tccatg": 764,
      "agtaac": 765,
      "agttgc": 766,
      "atttgg": 767,
      "tgcagg": 768,
      "gggcc": 769,
      "ataggg": 770,
      "tgcacc": 771,
      "tcttgg": 772,
      "agaggacag": 773,
      "agcttg": 774,
      "ttttttg": 775,
      "aacttc": 776,
      "attggg": 777,
      "tggttg": 778,
      "ataagc": 779,
      "tccctccc": 780,
      "tgaacc": 781,
      "acaaacaa": 782,
      "agtatt": 783,
      "gatc": 784,
      "agtatg": 785,
      "tatggg": 786,
      "aatgtg": 787,
      "atgacc": 788,
      "ttaccc": 789,
      "agtagg": 790,
      "tccaac": 791,
      "tggacc": 792,
      "tcattc": 793,
      "ttccttcc": 794,
      "atcacc": 795,
      "tgttgg": 796,
      "actatt": 797,
      "aatgcc": 798,
      "ttcagc": 799,
      "aatttc": 800,
      "atgttg": 801,
      "atttag": 802,
      "tgggggc": 803,
      "tatggc": 804,
      "gtgtg": 805,
      "gttg": 806,
      "tatttatt": 807,
      "aaggaagg": 808,
      "agacaggg": 809,
      "acatat": 810,
      "atgaag": 811,
      "gtac": 812,
      "ttacaa": 813,
      "acggg": 814,
      "aacagg": 815,
      "ctcc": 816,
      "taaatc": 817,
      "agagggg": 818,
      "ttcacc": 819,
      "atactc": 820,
      "tgatgc": 821,
      "tcaagg": 822,
      "tctatg": 823,
      "tgtaac": 824,
      "tgttgc": 825,
      "ttcatc": 826,
      "aggcg": 827,
      "agatag": 828,
      "tatctatc": 829,
      "tggggagg": 830,
      "aacttg": 831,
      "agacg": 832,
      "aggtac": 833,
      "ttaagg": 834,
      "tttagc": 835,
      "acagtgg": 836,
      "agcgc": 837,
      "ttatgg": 838,
      "agtagc": 839,
      "tcccg": 840,
      "tctctcc": 841,
      "agcatt": 842,
      "agttaa": 843,
      "ttactg": 844,
      "attctaggc": 845,
      "aagtgg": 846,
      "ttaacc": 847,
      "ttcagg": 848,
      "aacatg": 849,
      "acattg": 850,
      "tgcgc": 851,
      "taaaag": 852,
      "agaaggc": 853,
      "tatatt": 854,
      "agaaaac": 855,
      "agaagcc": 856,
      "ggccc": 857,
      "agtatc": 858,
      "tacatg": 859,
      "acttaa": 860,
      "agagggc": 861,
      "ttaggc": 862,
      "tgcatc": 863,
      "acagacag": 864,
      "tgagtc": 865,
      "agga": 866,
      "tcttccc": 867,
      "tggggcc": 868,
      "actaag": 869,
      "agtacc": 870,
      "tcctccc": 871,
      "ttaggg": 872,
      "aatggg": 873,
      "tcacaa": 874,
      "acctac": 875,
      "ttcatg": 876,
      "aatgtc": 877,
      "nnnnnnnn": 878,
      "ttagtg": 879,
      "ttgtgc": 880,
      "tgcctctgcc": 881,
      "ttctaa": 882,
      "tgtagc": 883,
      "aggtag": 884,
      "atctac": 885,
      "agcatg": 886,
      "aatctg": 887,
      "acatccc": 888,
      "tgttttg": 889,
      "tgtatc": 890,
      "ttaagc": 891,
      "cccccc": 892,
      "aagtaa": 893,
      "aggttg": 894,
      "aaga": 895,
      "gaggc": 896,
      "ttctttt": 897,
      "ctgc": 898,
      "aagagag": 899,
      "actacc": 900,
      "ttatgc": 901,
      "aactac": 902,
      "aatttg": 903,
      "agaaggg": 904,
      "cagc": 905,
      "atagtc": 906,
      "ttatcc": 907,
      "aactgg": 908,
      "tatgtatg": 909,
      "tgtacc": 910,
      "attt": 911,
      "tgcctag": 912,
      "actagg": 913,
      "atcatg": 914,
      "cacc": 915,
      "tggtggc": 916,
      "aggaagg": 917,
      "tctatc": 918,
      "ttcttcc": 919,
      "cccacc": 920,
      "attaaaa": 921,
      "tcaacc": 922,
      "agcgg": 923,
      "attatc": 924,
      "ttagtc": 925,
      "tgtgtgc": 926,
      "tggatc": 927,
      "aagagaa": 928,
      "agcccctcac": 929,
      "ttttccc": 930,
      "aggaagc": 931,
      "tgcctcc": 932,
      "agatac": 933,
      "aataac": 934,
      "ttactc": 935,
      "tggtag": 936,
      "actatc": 937,
      "aacagaa": 938,
      "agatggc": 939,
      "tgtagg": 940,
      "ttgtaa": 941,
      "atagac": 942,
      "actgtcc": 943,
      "attttaa": 944,
      "cttc": 945,
      "atgtat": 946,
      "tgggggg": 947,
      "tgatcc": 948,
      "agagaacagaagggc": 949,
      "tcatgc": 950,
      "tgattc": 951,
      "gtaa": 952,
      "aggagaa": 953,
      "acacacc": 954,
      "acgccccc": 955,
      "aacaag": 956,
      "tcgcc": 957,
      "cccagtg": 958,
      "tctaag": 959,
      "tagtcc": 960,
      "accaag": 961,
      "aggatt": 962,
      "tgga": 963,
      "tacatc": 964,
      "aggacag": 965,
      "atgagc": 966,
      "gtggc": 967,
      "gagag": 968,
      "atggatgg": 969,
      "tgtgtgtgtgtg": 970,
      "tcttaa": 971,
      "tgtggtggacag": 972,
      "aggctgg": 973,
      "acttccc": 974,
      "ttctag": 975,
      "tatacc": 976,
      "tacagc": 977,
      "tggtggacag": 978,
      "actagc": 979,
      "tgacaa": 980,
      "ttgtttt": 981,
      "aggggctctacc": 982,
      "catc": 983,
      "actgtccacc": 984,
      "tcaagc": 985,
      "ttgggaggc": 986,
      "tgtaag": 987,
      "ttct": 988,
      "aaatac": 989,
      "agcaac": 990,
      "atgtag": 991,
      "agcctggtctac": 992,
      "aaaaaaaaaaaa": 993,
      "atgtccc": 994,
      "ttcatt": 995,
      "aatatc": 996,
      "tcggc": 997,
      "tggaggc": 998,
      "accgc": 999,
      "atgaac": 1000,
      "accagg": 1001,
      "acatag": 1002,
      "tgctac": 1003,
      "tctatt": 1004,
      "aagacag": 1005,
      "tcctctc": 1006,
      "tgcgg": 1007,
      "agagtgag": 1008,
      "gaaaa": 1009,
      "tcagac": 1010,
      "atttctc": 1011,
      "ttgtac": 1012,
      "aggggcc": 1013,
      "ctgg": 1014,
      "tcctac": 1015,
      "aggaggg": 1016,
      "taaacc": 1017,
      "ttagtt": 1018,
      "tttcccc": 1019,
      "aatatg": 1020,
      "ttattg": 1021,
      "actaac": 1022,
      "gtag": 1023,
      "taaagc": 1024,
      "ttactt": 1025,
      "cccagg": 1026,
      "atcagg": 1027,
      "tccgc": 1028,
      "agcatcc": 1029,
      "cagg": 1030,
      "attatg": 1031,
      "tggctgtcc": 1032,
      "tcaaag": 1033,
      "agtgggg": 1034,
      "taaagg": 1035,
      "attgag": 1036,
      "actgccc": 1037,
      "tctgccc": 1038,
      "aagtag": 1039,
      "tatatc": 1040,
      "agggctac": 1041,
      "gagcc": 1042,
      "tcggg": 1043,
      "tgtctcc": 1044,
      "aatcaa": 1045,
      "ttccccc": 1046,
      "ttctctc": 1047,
      "gtctc": 1048,
      "aattgc": 1049,
      "attaac": 1050,
      "atgatc": 1051,
      "tatgtgtg": 1052,
      "aaacg": 1053,
      "aaatat": 1054,
      "tttttttttttt": 1055,
      "tcagccc": 1056,
      "tctaac": 1057,
      "ttgatc": 1058,
      "taatac": 1059,
      "tctagg": 1060,
      "tcactctg": 1061,
      "atctctc": 1062,
      "tcct": 1063,
      "ttgtag": 1064,
      "aagggcatcc": 1065,
      "taaaaaa": 1066,
      "acacacacacac": 1067,
      "tgggaag": 1068,
      "atctgcc": 1069,
      "agcagcc": 1070,
      "tctagc": 1071,
      "aggaaaa": 1072,
      "tcaaac": 1073,
      "aataag": 1074,
      "ttcaag": 1075,
      "tcacg": 1076,
      "agatccc": 1077,
      "atctctcc": 1078,
      "tagatg": 1079,
      "ttgagg": 1080,
      "tgtggtgg": 1081,
      "acagaagggcatcc": 1082,
      "aatgag": 1083,
      "aggcgg": 1084,
      "ttcaac": 1085,
      "agca": 1086,
      "taaatt": 1087,
      "tccttcc": 1088,
      "gctgc": 1089,
      "acagccc": 1090,
      "accaac": 1091,
      "ttgaag": 1092,
      "atacg": 1093,
      "agaaaag": 1094,
      "tggatt": 1095,
      "tggcg": 1096,
      "agggggc": 1097,
      "tgctgtg": 1098,
      "tttaatccc": 1099,
      "tgccacc": 1100,
      "tttgggg": 1101,
      "gatt": 1102,
      "acaggcc": 1103,
      "agagagc": 1104,
      "agattg": 1105,
      "tttctctgtg": 1106,
      "tgagagg": 1107,
      "atctctg": 1108,
      "aacatt": 1109,
      "tcctggg": 1110,
      "tggctgc": 1111,
      "tcctaa": 1112,
      "atgt": 1113,
      "aatacc": 1114,
      "ttccctttt": 1115,
      "tacttc": 1116,
      "atccacc": 1117,
      "aagatt": 1118,
      "atctag": 1119,
      "atcatt": 1120,
      "tggaagg": 1121,
      "aatcag": 1122,
      "ttggggc": 1123,
      "tccagcc": 1124,
      "tgggggattctaggc": 1125,
      "acaaaac": 1126,
      "aatgac": 1127,
      "ctac": 1128,
      "aggcagg": 1129,
      "aatgtt": 1130,
      "tttcttc": 1131,
      "aatagc": 1132,
      "aagaagg": 1133,
      "tctctgc": 1134,
      "tgcctgc": 1135,
      "cttg": 1136,
      "aaaagaa": 1137,
      "acatgcc": 1138,
      "taaataa": 1139,
      "agacagag": 1140,
      "tagagcccc": 1141,
      "tccaag": 1142,
      "ttttaaaa": 1143,
      "tacttg": 1144,
      "acagggc": 1145,
      "tgtcccc": 1146,
      "agaaccc": 1147,
      "tcccaagtgc": 1148,
      "atcagc": 1149,
      "tctgtctg": 1150,
      "aaattg": 1151,
      "aaca": 1152,
      "ggagg": 1153,
      "aaagaaaa": 1154,
      "acccg": 1155,
      "acacagc": 1156,
      "tgtcttc": 1157,
      "atttccc": 1158,
      "tgacg": 1159,
      "tgct": 1160,
      "agatat": 1161,
      "acacccc": 1162,
      "tggtgtg": 1163,
      "ttgagc": 1164,
      "tggtaa": 1165,
      "tagttc": 1166,
      "tctcttc": 1167,
      "tataaaa": 1168,
      "agccg": 1169,
      "tgttaa": 1170,
      "gcgg": 1171,
      "tttctcc": 1172,
      "actgggg": 1173,
      "tacagg": 1174,
      "gccccc": 1175,
      "tgataa": 1176,
      "ttttgcc": 1177,
      "atct": 1178,
      "agagacc": 1179,
      "tggctc": 1180,
      "tgcacac": 1181,
      "ttgatg": 1182,
      "tctcagc": 1183,
      "acagagg": 1184,
      "atatatatatatatat": 1185,
      "ttggggg": 1186,
      "aggcagc": 1187,
      "catg": 1188,
      "atctaa": 1189,
      "aaatag": 1190,
      "tttgtttt": 1191,
      "tacacc": 1192,
      "ttccg": 1193,
      "ttccttc": 1194,
      "atccg": 1195,
      "tgtggcc": 1196,
      "ttta": 1197,
      "ttcctcc": 1198,
      "agagag": 1199,
      "agcaccc": 1200,
      "tttctgc": 1201,
      "tagaaaa": 1202,
      "agctaa": 1203,
      "agggagg": 1204,
      "tattgc": 1205,
      "acattcc": 1206,
      "aagaagc": 1207,
      "acatggc": 1208,
      "tctcccc": 1209,
      "agct": 1210,
      "aaacaaaa": 1211,
      "tggt": 1212,
      "attacc": 1213,
      "aatcac": 1214,
      "taattc": 1215,
      "agctggg": 1216,
      "ggggcc": 1217,
      "aattgg": 1218,
      "ttagac": 1219,
      "tggcttc": 1220,
      "tagagcc": 1221,
      "gtggg": 1222,
      "ttgacc": 1223,
      "gaggcc": 1224,
      "aataaaa": 1225,
      "tccgg": 1226,
      "agaaacc": 1227,
      "gaagg": 1228,
      "agaaatg": 1229,
      "agttccc": 1230,
      "aggagcc": 1231,
      "aggtaa": 1232,
      "tccctcc": 1233,
      "gacag": 1234,
      "aagacac": 1235,
      "atatttt": 1236,
      "tggagcc": 1237,
      "tagatc": 1238,
      "tcattg": 1239,
      "aaagagg": 1240,
      "atacatac": 1241,
      "agctgcc": 1242,
      "tgtgccc": 1243,
      "agaga": 1244,
      "atgtctc": 1245,
      "agcaagc": 1246,
      "tccatt": 1247,
      "tacatt": 1248,
      "tagacag": 1249,
      "aagggcc": 1250,
      "tcagagg": 1251,
      "tgttttc": 1252,
      "aggggctctaccactgagcc": 1253,
      "atgtatg": 1254,
      "tgattg": 1255,
      "agagccc": 1256,
      "tttctttt": 1257,
      "tccacac": 1258,
      "tctgtgg": 1259,
      "agagaacag": 1260,
      "ttctgcc": 1261,
      "gaggg": 1262,
      "ttgaaaa": 1263,
      "ttatat": 1264,
      "tagaccaggctggcc": 1265,
      "agtggcc": 1266,
      "tcca": 1267,
      "ttgggcc": 1268,
      "tactgc": 1269,
      "aacgc": 1270,
      "actggcc": 1271,
      "tagtgc": 1272,
      "tgtgtgg": 1273,
      "aatagg": 1274,
      "acca": 1275,
      "tcataa": 1276,
      "aggacac": 1277,
      "atccatcc": 1278,
      "aacacac": 1279,
      "taatgc": 1280,
      "ttgatt": 1281,
      "tataag": 1282,
      "ggaag": 1283,
      "agatgcc": 1284,
      "agaatac": 1285,
      "ttgtctc": 1286,
      "agagtac": 1287,
      "aggcaggc": 1288,
      "accacag": 1289,
      "aactaa": 1290,
      "tgtgggg": 1291,
      "ttatttt": 1292,
      "ggagc": 1293,
      "atagagg": 1294,
      "atggttg": 1295,
      "gccacc": 1296,
      "ttcctgc": 1297,
      "gtccc": 1298,
      "ttctccc": 1299,
      "agccacc": 1300,
      "ttatac": 1301,
      "aaggccc": 1302,
      "tacacac": 1303,
      "aatctt": 1304,
      "agacagg": 1305,
      "tccagag": 1306,
      "aaggaag": 1307,
      "tgcaag": 1308,
      "taga": 1309,
      "ttatag": 1310,
      "tgggttc": 1311,
      "tatagc": 1312,
      "cacac": 1313,
      "tgggagg": 1314,
      "cgc": 1315,
      "aaaagcc": 1316,
      "attaag": 1317,
      "taaa": 1318,
      "gagaa": 1319,
      "aaaaggc": 1320,
      "agccccc": 1321,
      "tactac": 1322,
      "tgccccc": 1323,
      "acagagaaaccc": 1324,
      "acct": 1325,
      "agacatc": 1326,
      "tcaaactc": 1327,
      "tataac": 1328,
      "acagggg": 1329,
      "agcacttgggaggc": 1330,
      "atggggg": 1331,
      "ttgt": 1332,
      "tgcatgc": 1333,
      "agtcccc": 1334,
      "agcactg": 1335,
      "tttattc": 1336,
      "agcttcc": 1337,
      "tgcctgg": 1338,
      "tggcgc": 1339,
      "aacgg": 1340,
      "gtttt": 1341,
      "atttttg": 1342,
      "acgccc": 1343,
      "atcgc": 1344,
      "tgggggcg": 1345,
      "aaagccc": 1346,
      "agagatg": 1347,
      "ggcg": 1348,
      "ttcgg": 1349,
      "caag": 1350,
      "tgttccc": 1351,
      "tgccg": 1352,
      "agggccc": 1353,
      "ttttgtttt": 1354,
      "tctggcc": 1355,
      "aaaggcc": 1356,
      "tggctgg": 1357,
      "ttctctg": 1358,
      "aagt": 1359,
      "actgggc": 1360,
      "aaaatac": 1361,
      "tgaggcc": 1362,
      "tgca": 1363,
      "agatggg": 1364,
      "acccagc": 1365,
      "taaggcc": 1366,
      "acacgc": 1367,
      "actgagc": 1368,
      "tgtgggc": 1369,
      "atatccc": 1370,
      "agaaagg": 1371,
      "agaaatcc": 1372,
      "tgagccc": 1373,
      "agacccc": 1374,
      "atga": 1375,
      "ttctgtg": 1376,
      "acaaggc": 1377,
      "tattttg": 1378,
      "ttca": 1379,
      "aatcccccagtg": 1380,
      "atcttcc": 1381,
      "aaggggc": 1382,
      "tctttcc": 1383,
      "agaaagc": 1384,
      "agtgccc": 1385,
      "gaagc": 1386,
      "accacac": 1387,
      "tgctaa": 1388,
      "ttctttc": 1389,
      "tctgggc": 1390,
      "tggagtt": 1391,
      "tcctt": 1392,
      "tagtaa": 1393,
      "tccctgc": 1394,
      "atttttc": 1395,
      "tggaaaa": 1396,
      "tgagtgc": 1397,
      "aggt": 1398,
      "agcactc": 1399,
      "caac": 1400,
      "tcctctg": 1401,
      "accaaaa": 1402,
      "aaggatg": 1403,
      "ttctggg": 1404,
      "agagatc": 1405,
      "accaggc": 1406,
      "acatggg": 1407,
      "tagtac": 1408,
      "acagaag": 1409,
      "tgcttcc": 1410,
      "aact": 1411,
      "atggggc": 1412,
      "cgg": 1413,
      "attttcc": 1414,
      "tggagaa": 1415,
      "aaagggg": 1416,
      "acatacac": 1417,
      "aaagaag": 1418,
      "agggaag": 1419,
      "tata": 1420,
      "tcccagg": 1421,
      "tggatgg": 1422,
      "tgggatc": 1423,
      "acctctg": 1424,
      "tctcg": 1425,
      "tcctggc": 1426,
      "tcctcctcctcc": 1427,
      "gggggggg": 1428,
      "atttgaa": 1429,
      "agcaggc": 1430,
      "acccagg": 1431,
      "agattcc": 1432,
      "acttggg": 1433,
      "aagcg": 1434,
      "aaaaccc": 1435,
      "tggcccc": 1436,
      "acctag": 1437,
      "acagaac": 1438,
      "actcccc": 1439,
      "tctgtctc": 1440,
      "atttttaa": 1441,
      "atgaaaa": 1442,
      "ttccaggacagcc": 1443,
      "tgctttt": 1444,
      "ttctttg": 1445,
      "tggtttt": 1446,
      "tgggaac": 1447,
      "atttctt": 1448,
      "agtgggc": 1449,
      "aaagaac": 1450,
      "atggccc": 1451,
      "atgtttt": 1452,
      "gcagc": 1453,
      "taaagaa": 1454,
      "tccaggc": 1455,
      "ttacg": 1456,
      "tacaag": 1457,
      "tgaaccc": 1458,
      "aattccc": 1459,
      "atctccc": 1460,
      "atctat": 1461,
      "atca": 1462,
      "tgggtgc": 1463,
      "tgtctgc": 1464,
      "tcttaacc": 1465,
      "atctt": 1466,
      "atctgtg": 1467,
      "tcatac": 1468,
      "ggtgc": 1469,
      "tctgggg": 1470,
      "tggttgc": 1471,
      "acttgcc": 1472,
      "atgcg": 1473,
      "gccg": 1474,
      "tcagtggtagagcccc": 1475,
      "ttctat": 1476,
      "acaagcc": 1477,
      "tgggattaaaggc": 1478,
      "tagttg": 1479,
      "tccaggg": 1480,
      "tggaactcactctg": 1481,
      "tcctcccc": 1482,
      "tacacag": 1483,
      "aacatcc": 1484,
      "agccagg": 1485,
      "accgg": 1486,
      "tggagagg": 1487,
      "acgcccccagcccctcac": 1488,
      "ttacagg": 1489,
      "tcagaag": 1490,
      "acctggg": 1491,
      "agacagc": 1492,
      "atgatt": 1493,
      "tggaaag": 1494,
      "agagagaa": 1495,
      "aaccg": 1496,
      "tatataa": 1497,
      "tatttac": 1498,
      "atccccc": 1499,
      "taaaagc": 1500,
      "atccgg": 1501,
      "aagaagaagaag": 1502,
      "aggctgc": 1503,
      "acctccc": 1504,
      "aggaccc": 1505,
      "acagaagg": 1506,
      "acagagc": 1507,
      "tgggagc": 1508,
      "atcaac": 1509,
      "tcctag": 1510,
      "taca": 1511,
      "acctgcc": 1512,
      "tggctcc": 1513,
      "actcg": 1514,
      "cagag": 1515,
      "tagagagagg": 1516,
      "taattg": 1517,
      "tgctgcc": 1518,
      "tgtgtcc": 1519,
      "acaagaa": 1520,
      "atgcatg": 1521,
      "gctcc": 1522,
      "aaggggg": 1523,
      "aggag": 1524,
      "attcg": 1525,
      "ttctgtc": 1526,
      "tgagggc": 1527,
      "agctag": 1528,
      "agccatc": 1529,
      "tttcagg": 1530,
      "ttga": 1531,
      "aaagggc": 1532,
      "tattgg": 1533,
      "tatatat": 1534,
      "ttcgc": 1535,
      "tgggtgg": 1536,
      "agagaacagaag": 1537,
      "tacaac": 1538,
      "tttcg": 1539,
      "tgatac": 1540,
      "tatggcc": 1541,
      "actcagc": 1542,
      "taatttt": 1543,
      "aggaggaggagg": 1544,
      "aggctcc": 1545,
      "attacag": 1546,
      "agggtctc": 1547,
      "agggatg": 1548,
      "agggggg": 1549,
      "taatcc": 1550,
      "aggtgtg": 1551,
      "aagcccc": 1552,
      "acgggc": 1553,
      "agacacc": 1554,
      "tttgttg": 1555,
      "aaccccc": 1556,
      "atttgtg": 1557,
      "gtgcc": 1558,
      "tcatag": 1559,
      "aaagatg": 1560,
      "acccacc": 1561,
      "agaagacagaagggc": 1562,
      "ctctc": 1563,
      "gccgc": 1564,
      "aagttcc": 1565,
      "nnnnnnnnnnnnnnnn": 1566,
      "tgagaag": 1567,
      "tggaagc": 1568,
      "tatgggg": 1569,
      "tgaaggc": 1570,
      "acatttt": 1571,
      "aaaaatg": 1572,
      "agcctgc": 1573,
      "tcccacc": 1574,
      "tgggggcgtggc": 1575,
      "cttcc": 1576,
      "agcagag": 1577,
      "attcattc": 1578,
      "tgtcg": 1579,
      "tactcc": 1580,
      "aaaacaaaac": 1581,
      "agctctc": 1582,
      "ttgtat": 1583,
      "ttggccc": 1584,
      "tggaggg": 1585,
      "atcgg": 1586,
      "tggactg": 1587,
      "tctcctctc": 1588,
      "agta": 1589,
      "atta": 1590,
      "tgctctc": 1591,
      "tgggccc": 1592,
      "atgtt": 1593,
      "aggcccc": 1594,
      "aacagcc": 1595,
      "tgctt": 1596,
      "tatttaa": 1597,
      "aacagag": 1598,
      "tcgaactc": 1599,
      "agctgtg": 1600,
      "ctgcc": 1601,
      "aaataaaa": 1602,
      "tgcttgc": 1603,
      "tcccccc": 1604,
      "tggacac": 1605,
      "aagacaa": 1606,
      "tcatat": 1607,
      "catt": 1608,
      "acgggg": 1609,
      "tggtt": 1610,
      "ataaaac": 1611,
      "tctctgcc": 1612,
      "aagaggc": 1613,
      "tctgtag": 1614,
      "agaggacagaagggc": 1615,
      "tctgaag": 1616,
      "ttgtt": 1617,
      "atgcacac": 1618,
      "tccttgg": 1619,
      "aatgggg": 1620,
      "cagcc": 1621,
      "acggcc": 1622,
      "tgta": 1623,
      "aggacg": 1624,
      "aagatgg": 1625,
      "acctgtg": 1626,
      "tggcagc": 1627,
      "tacagag": 1628,
      "ctgtg": 1629,
      "tcagggc": 1630,
      "tgcagcc": 1631,
      "tcctgag": 1632,
      "taatag": 1633,
      "tggatgc": 1634,
      "aaatccc": 1635,
      "aagag": 1636,
      "tgcaac": 1637,
      "aagtctc": 1638,
      "acaga": 1639,
      "taactcc": 1640,
      "tttcttg": 1641,
      "atgggcc": 1642,
      "agaaagagg": 1643,
      "tctgtcc": 1644,
      "aaatgcc": 1645,
      "aggtctc": 1646,
      "acagacac": 1647,
      "aaacacc": 1648,
      "agcaggg": 1649,
      "actctgc": 1650,
      "tagggcc": 1651,
      "aagaccc": 1652,
      "aactcagg": 1653,
      "ttaataa": 1654,
      "ttgtgtg": 1655,
      "atgtggg": 1656,
      "tggagtc": 1657,
      "atccatc": 1658,
      "ttttggg": 1659,
      "tgagggg": 1660,
      "tggag": 1661,
      "tgtttcc": 1662,
      "acagacc": 1663,
      "ctaa": 1664,
      "tttttcc": 1665,
      "ttcacac": 1666,
      "tctgtgc": 1667,
      "tggctac": 1668,
      "gacac": 1669,
      "tcccaac": 1670,
      "aagcagg": 1671,
      "agaaa": 1672,
      "atcctcc": 1673,
      "gatgg": 1674,
      "tcaggcc": 1675,
      "aggcagag": 1676,
      "gtat": 1677,
      "acctctc": 1678,
      "tctctctctctc": 1679,
      "gaccc": 1680,
      "gttcc": 1681,
      "tcctgtc": 1682,
      "tctttaa": 1683,
      "gtgtc": 1684,
      "tttctac": 1685,
      "tgagatt": 1686,
      "tccaccc": 1687,
      "tctttctc": 1688,
      "agcacac": 1689,
      "aaacccc": 1690,
      "tcacacc": 1691,
      "tatacac": 1692,
      "ttttgttttg": 1693,
      "agctggc": 1694,
      "tttct": 1695,
      "aggccagcc": 1696,
      "aaggagg": 1697,
      "accatt": 1698,
      "taaacaa": 1699,
      "tgcagag": 1700,
      "tgcaggg": 1701,
      "aatgccc": 1702,
      "gcttc": 1703,
      "tgaagcc": 1704,
      "taagggg": 1705,
      "taaacag": 1706,
      "ttgttgg": 1707,
      "tgtccacc": 1708,
      "aagtccc": 1709,
      "ttcagag": 1710,
      "tttggcc": 1711,
      "atcaaaa": 1712,
      "agtagag": 1713,
      "tgacccc": 1714,
      "acta": 1715,
      "tgtgtac": 1716,
      "tgcaggc": 1717,
      "aggaacc": 1718,
      "tagtgg": 1719,
      "agacaac": 1720,
      "gagtg": 1721,
      "tgcatt": 1722,
      "agagaa": 1723,
      "aagaggg": 1724,
      "tgctag": 1725,
      "aatcccccagtgaggggc": 1726,
      "tcttgcc": 1727,
      "ggcgc": 1728,
      "tgctggc": 1729,
      "agtcacc": 1730,
      "tgtgagc": 1731,
      "ataagcc": 1732,
      "ttttttc": 1733,
      "tgaaaac": 1734,
      "ctag": 1735,
      "tgctctg": 1736,
      "agctctg": 1737,
      "acagatg": 1738,
      "ctctg": 1739,
      "actttcc": 1740,
      "acttggc": 1741,
      "tggtctc": 1742,
      "agacaag": 1743,
      "tcttttc": 1744,
      "tgctgtc": 1745,
      "atctggg": 1746,
      "tgcatcc": 1747,
      "ttcctgg": 1748,
      "atttgcc": 1749,
      "ctccc": 1750,
      "agcatgc": 1751,
      "agtagcc": 1752,
      "taaaacc": 1753,
      "ttgtttc": 1754,
      "tagatt": 1755,
      "atgtgcc": 1756,
      "agaaatc": 1757,
      "gtt": 1758,
      "gatgc": 1759,
      "tttgccc": 1760,
      "atctgtaa": 1761,
      "tggaacc": 1762,
      "tgggaattg": 1763,
      "caggc": 1764,
      "atgttcc": 1765,
      "aagtt": 1766,
      "gccgcc": 1767,
      "aaaaaac": 1768,
      "acaaacc": 1769,
      "ttcacag": 1770,
      "agctt": 1771,
      "accttcc": 1772,
      "agtgtgg": 1773,
      "ttgagaa": 1774,
      "tgggtcc": 1775,
      "aatcg": 1776,
      "agaagggcatcc": 1777,
      "accagcc": 1778,
      "agggcatc": 1779,
      "tatagg": 1780,
      "ttcttcttcttc": 1781,
      "agctccc": 1782,
      "atattcc": 1783,
      "ttggaac": 1784,
      "agcacttgggaggcagaggc": 1785,
      "aaatggc": 1786,
      "tcctgtg": 1787,
      "tgcacag": 1788,
      "aagagcc": 1789,
      "aaaaatc": 1790,
      "caggg": 1791,
      "ttgctgc": 1792,
      "tttgttc": 1793,
      "cccccccc": 1794,
      "tgttggg": 1795,
      "ttgcttc": 1796,
      "agcctggtctacagagtgag": 1797,
      "acacatg": 1798,
      "tgtatgc": 1799,
      "agcaaaa": 1800,
      "aagcgc": 1801,
      "tacgg": 1802,
      "agttcgaggcc": 1803,
      "tacgc": 1804,
      "ttttggc": 1805,
      "ttttatt": 1806,
      "ttgtgtc": 1807,
      "catcc": 1808,
      "gagagg": 1809,
      "agaca": 1810,
      "ttgacag": 1811,
      "agtctcc": 1812,
      "aata": 1813,
      "aagggcatccagag": 1814,
      "aaaaggg": 1815,
      "tggtat": 1816,
      "ttcagcc": 1817,
      "ttcattc": 1818,
      "atggatg": 1819,
      "tgagaac": 1820,
      "agacatg": 1821,
      "ttgagag": 1822,
      "acaca": 1823,
      "aaggaac": 1824,
      "tcagtgc": 1825,
      "acctt": 1826,
      "tcagatg": 1827,
      "tctctgtg": 1828,
      "tggcatc": 1829,
      "acaaagc": 1830,
      "tcacagc": 1831,
      "agaaaggc": 1832,
      "agatttc": 1833,
      "ttcaggg": 1834,
      "ggaac": 1835,
      "atctttt": 1836,
      "atggagg": 1837,
      "tgctccc": 1838,
      "ttacagc": 1839,
      "tcacccc": 1840,
      "tttcttcc": 1841,
      "acaaagg": 1842,
      "aaacaac": 1843,
      "atatgcc": 1844,
      "tgtgt": 1845,
      "aaattcc": 1846,
      "tatgggc": 1847,
      "atagatagatagatag": 1848,
      "actgtgg": 1849,
      "aaaaataa": 1850,
      "ccg": 1851,
      "tcttggc": 1852,
      "ttaaaac": 1853,
      "acaccccc": 1854,
      "tttgggc": 1855,
      "tggattc": 1856,
      "tatgtac": 1857,
      "attttgg": 1858,
      "atgtctg": 1859,
      "attcccc": 1860,
      "tggcttg": 1861,
      "aaaaacc": 1862,
      "aaacatc": 1863,
      "tcagggg": 1864,
      "ttttatg": 1865,
      "gggggc": 1866,
      "taatat": 1867,
      "attgggg": 1868,
      "tgtcttg": 1869,
      "aggagtc": 1870,
      "aagaacc": 1871,
      "aggcgc": 1872,
      "acatacc": 1873,
      "tggga": 1874,
      "agttggg": 1875,
      "tgatat": 1876,
      "actaggc": 1877,
      "ccccc": 1878,
      "tgcctgcc": 1879,
      "atagccc": 1880,
      "tttctttctttctttc": 1881,
      "agcctcc": 1882,
      "ttgaactc": 1883,
      "atccagg": 1884,
      "tggacaa": 1885,
      "agtgtac": 1886,
      "acaaggg": 1887,
      "tcta": 1888,
      "tgctttc": 1889,
      "aggcatg": 1890,
      "tggtggg": 1891,
      "atttatc": 1892,
      "ttctacc": 1893,
      "agactcc": 1894,
      "agtgagg": 1895,
      "tgagatg": 1896,
      "tggtctac": 1897,
      "tcagaac": 1898,
      "ttcaagg": 1899,
      "aattttg": 1900,
      "aatcccc": 1901,
      "ctggg": 1902,
      "actcagg": 1903,
      "aaatttt": 1904,
      "ttcttgg": 1905,
      "tccctgtggtggacag": 1906,
      "aaaaaag": 1907,
      "tttctctgtgtagccc": 1908,
      "tcatccc": 1909,
      "accaagc": 1910,
      "attagc": 1911,
      "tgacatc": 1912,
      "accagag": 1913,
      "agccgc": 1914,
      "tcttttg": 1915,
      "tggcagg": 1916,
      "agggagc": 1917,
      "tttgtaa": 1918,
      "tatttttt": 1919,
      "ttctgaa": 1920,
      "ttcaggc": 1921,
      "tagcccc": 1922,
      "acacagg": 1923,
      "tattccc": 1924,
      "attagg": 1925,
      "tgtttac": 1926,
      "tgctat": 1927,
      "attttgc": 1928,
      "actgagg": 1929,
      "agagaaaa": 1930,
      "gagtc": 1931,
      "aactgcc": 1932,
      "tcccaag": 1933,
      "aactctc": 1934,
      "tttgagg": 1935,
      "gtctg": 1936,
      "tgaagaa": 1937,
      "atgctcc": 1938,
      "ataagaa": 1939,
      "tcttcccc": 1940,
      "tgcctctgcctcccaagtgc": 1941,
      "atatggc": 1942,
      "atagaac": 1943,
      "acctggc": 1944,
      "tgagtac": 1945,
      "ataataa": 1946,
      "aaaatat": 1947,
      "agagaaaag": 1948,
      "tgtgtgtgc": 1949,
      "tttatcc": 1950,
      "aacaccc": 1951,
      "ttcctgcc": 1952,
      "tctgagc": 1953,
      "tgtcacc": 1954,
      "ggtgg": 1955,
      "aaagtaa": 1956,
      "aagggcatccagagagagg": 1957,
      "gctgg": 1958,
      "ttcagtc": 1959,
      "atttatg": 1960,
      "ttcagtg": 1961,
      "agtttcc": 1962,
      "aaagagc": 1963,
      "agatttt": 1964,
      "atacatg": 1965,
      "aggctagcc": 1966,
      "tcttggg": 1967,
      "ttgtccc": 1968,
      "gaacc": 1969,
      "ttcttgc": 1970,
      "actgtaa": 1971,
      "tacaaaa": 1972,
      "tactgg": 1973,
      "ttaaaag": 1974,
      "tgactgc": 1975,
      "agaatggc": 1976,
      "tggaaagg": 1977,
      "ttcatcc": 1978,
      "ttttt": 1979,
      "attggcc": 1980,
      "tcagagc": 1981,
      "tcacgg": 1982,
      "tgcattc": 1983,
      "cagtg": 1984,
      "aacactg": 1985,
      "actcacc": 1986,
      "taccg": 1987,
      "agccttg": 1988,
      "tggggaggatg": 1989,
      "aaaga": 1990,
      "ataaatg": 1991,
      "atctgaa": 1992,
      "aagatgc": 1993,
      "tagaagg": 1994,
      "acacgg": 1995,
      "gcagg": 1996,
      "actctgg": 1997,
      "tgaacag": 1998,
      "aaactcc": 1999,
      "aggcttg": 2000,
      "actaagg": 2001,
      "ttctctcc": 2002,
      "tttttat": 2003,
      "tttgtgc": 2004,
      "ttcagaa": 2005,
      "cacag": 2006,
      "agggaagg": 2007,
      "ttagaac": 2008,
      "taat": 2009,
      "tttttac": 2010,
      "agttgcc": 2011,
      "atcagaa": 2012,
      "atctttc": 2013,
      "agggacc": 2014,
      "atgcatgc": 2015,
      "ttctggc": 2016,
      "tgagacc": 2017,
      "aaagacc": 2018,
      "tctctgg": 2019,
      "acaaa": 2020,
      "aggatgg": 2021,
      "ttccacc": 2022,
      "acaaccc": 2023,
      "aagtat": 2024,
      "aggagagg": 2025,
      "aatttac": 2026,
      "tcgggg": 2027,
      "taggggc": 2028,
      "atctgtc": 2029,
      "taagggc": 2030,
      "atttaag": 2031,
      "actgaac": 2032,
      "ttctaag": 2033,
      "tgtgtatg": 2034,
      "attgccc": 2035,
      "agtcg": 2036,
      "ttggacag": 2037,
      "taatgg": 2038,
      "tgggctac": 2039,
      "agcagaa": 2040,
      "aagataa": 2041,
      "aagcatg": 2042,
      "tcaaggc": 2043,
      "gcacc": 2044,
      "agagagaag": 2045,
      "atagatg": 2046,
      "ggcggc": 2047,
      "aagtgtg": 2048,
      "tgactcc": 2049,
      "tgcaccc": 2050,
      "atggacag": 2051,
      "aggtat": 2052,
      "gtttc": 2053,
      "atggtgg": 2054,
      "tagt": 2055,
      "ctggc": 2056,
      "agatagagg": 2057,
      "aacattc": 2058,
      "tctgttg": 2059,
      "aaacagc": 2060,
      "tggagagatggc": 2061,
      "gagac": 2062,
      "acagagaaaccctgtctc": 2063,
      "ttcaaaa": 2064,
      "taaagcc": 2065,
      "ttagaag": 2066,
      "ttacat": 2067,
      "aggga": 2068,
      "tctttgc": 2069,
      "caaaa": 2070,
      "tgagagc": 2071,
      "aattcccagc": 2072,
      "ctttt": 2073,
      "tcctttt": 2074,
      "tggct": 2075,
      "ttccagc": 2076,
      "aaaacaaaa": 2077,
      "actgaag": 2078,
      "ttagagg": 2079,
      "actaccc": 2080,
      "tgatag": 2081,
      "aggcagaggc": 2082,
      "attattattatt": 2083,
      "tgatgccc": 2084,
      "tgatgcc": 2085,
      "ggatg": 2086,
      "tttgtgg": 2087,
      "acagaaaa": 2088,
      "atttgtc": 2089,
      "tagaagc": 2090,
      "tctgagg": 2091,
      "tttgaac": 2092,
      "atgctgg": 2093,
      "tcaaagg": 2094,
      "tctgttc": 2095,
      "aggcacc": 2096,
      "atgcccc": 2097,
      "ataaatc": 2098,
      "tgaaggg": 2099,
      "tgtgcg": 2100,
      "aagtgaa": 2101,
      "tgtgttg": 2102,
      "acgtgc": 2103,
      "caccc": 2104,
      "aagcagc": 2105,
      "tggatcc": 2106,
      "acacaac": 2107,
      "tcacagg": 2108,
      "tttatgg": 2109,
      "tgtagcc": 2110,
      "tacttcc": 2111,
      "acaaatg": 2112,
      "agaggaactgc": 2113,
      "tgtgatg": 2114,
      "tgtttgc": 2115,
      "aagctgc": 2116,
      "aaaatgc": 2117,
      "cagaa": 2118,
      "atttcaa": 2119,
      "tgggacc": 2120,
      "tcgggc": 2121,
      "acgtccc": 2122,
      "aggcatc": 2123,
      "tctgacc": 2124,
      "agctgtc": 2125,
      "actgtgc": 2126,
      "ccacc": 2127,
      "actctcc": 2128,
      "tcactgc": 2129,
      "atgtggc": 2130,
      "agggaac": 2131,
      "atttacc": 2132,
      "ggcccc": 2133,
      "aaaaa": 2134,
      "tttttatt": 2135,
      "agtaagg": 2136,
      "ataaggc": 2137,
      "tact": 2138,
      "agaaagag": 2139,
      "acacacacacacacacacac": 2140,
      "atcagag": 2141,
      "ttcatgg": 2142,
      "atccagagagatg": 2143,
      "tcctgaa": 2144,
      "atttggg": 2145,
      "tcacagag": 2146,
      "atgagcc": 2147,
      "aagactc": 2148,
      "ttgtttg": 2149,
      "aaatggg": 2150,
      "tctagag": 2151,
      "agacgc": 2152,
      "tttctgg": 2153,
      "tttctaa": 2154,
      "tagtag": 2155,
      "atctcaa": 2156,
      "accctcc": 2157,
      "ttgaagc": 2158,
      "tctgt": 2159,
      "aatgtaa": 2160,
      "agtaaaa": 2161,
      "ttatatt": 2162,
      "tccccactg": 2163,
      "taccccc": 2164,
      "tcttccagagg": 2165,
      "aagga": 2166,
      "tctct": 2167,
      "agggagag": 2168,
      "accctgc": 2169,
      "aagggaatcc": 2170,
      "ctgtc": 2171,
      "aggtggg": 2172,
      "aggtggc": 2173,
      "tcacaac": 2174,
      "agacttg": 2175,
      "tgacttc": 2176,
      "agtgtgc": 2177,
      "ataggcc": 2178,
      "atcacac": 2179,
      "gttgg": 2180,
      "aagaaac": 2181,
      "tatgtgc": 2182,
      "tccacag": 2183,
      "aggca": 2184,
      "gtagc": 2185,
      "atcatcc": 2186,
      "aatattc": 2187,
      "atatggg": 2188,
      "gttgc": 2189,
      "gattc": 2190,
      "atatatg": 2191,
      "gtttg": 2192,
      "atgacac": 2193,
      "tttaccc": 2194,
      "tcccctcccc": 2195,
      "atacatgc": 2196,
      "actagag": 2197,
      "tccttgc": 2198,
      "atcacag": 2199,
      "accctgg": 2200,
      "tcccttcc": 2201,
      "aagtgcc": 2202,
      "tgacagc": 2203,
      "aaggacc": 2204,
      "gatcc": 2205,
      "ttgtggg": 2206,
      "gtgaa": 2207,
      "tcggcc": 2208,
      "aagattc": 2209,
      "tgttgcc": 2210,
      "aagtttt": 2211,
      "acacagag": 2212,
      "atggtgc": 2213,
      "tatttat": 2214,
